### **Data Exploration**

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pylab as plt
%matplotlib inline
sns.set(color_codes=True)

import datetime as dt
from datetime import datetime
from siuba import _
from siuba.dply.verbs import group_by,mutate,select,summarize,ungroup

In [6]:
import os
os.chdir('C:\\Users\\User\\projects\\Netflix')
os.getcwd()

'C:\\Users\\User\\projects\\Netflix'

In [7]:
df= pd.read_csv('netflix_titles.csv')
print('Data downloaded and read into a dataframe!')

Data downloaded and read into a dataframe!

In [8]:
df.head()

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,81145628,Movie,Norm of the North: King Sized Adventure,"Richard Finn, Tim Maltby","Alan Marriott, Andrew Toth, Brian Dobson, Cole...","United States, India, South Korea, China","September 9, 2019",2019,TV-PG,90 min,"Children & Family Movies, Comedies",Before planning an awesome wedding for his gra...
1,80117401,Movie,Jandino: Whatever it Takes,NaN,Jandino Asporaat,United Kingdom,"September 9, 2016",2016,TV-MA,94 min,Stand-Up Comedy,Jandino Asporaat riffs on the challenges of ra...
2,70234439,TV Show,Transformers Prime,NaN,"Peter Cullen, Sumalee Montano, Frank Welker, J...",United States,"September 8, 2018",2013,TV-Y7-FV,1 Season,Kids' TV,"With the help of three human allies, the Autob..."
3,80058654,TV Show,Transformers: Robots in Disguise,NaN,"Will Friedle, Darren Criss, Constance Zimmer, ...",United States,"September 8, 2018",2016,TV-Y7,1 Season,Kids' TV,When a prison ship crash unleashes hundreds of...
4,80125979,Movie,#realityhigh,Fernando Lebrija,"Nesta Cooper, Kate Walsh, John Michael Higgins...",United States,"September 8, 2017",2017,TV-14,99 min,Comedies,When nerdy high schooler Dani finally attracts...

In [9]:
#Returns no of rows & columns
df.shape

(6234, 12)

In [10]:
df.drop_duplicates(inplace=True)
df.shape

(6234, 12)

In [11]:
df.drop(['title','cast','director','description'],axis=1,inplace=True)
df.head()

,show_id,type,country,date_added,release_year,rating,duration,listed_in
0,81145628,Movie,"United States, India, South Korea, China","September 9, 2019",2019,TV-PG,90 min,"Children & Family Movies, Comedies"
1,80117401,Movie,United Kingdom,"September 9, 2016",2016,TV-MA,94 min,Stand-Up Comedy
2,70234439,TV Show,United States,"September 8, 2018",2013,TV-Y7-FV,1 Season,Kids' TV
3,80058654,TV Show,United States,"September 8, 2018",2016,TV-Y7,1 Season,Kids' TV
4,80125979,Movie,United States,"September 8, 2017",2017,TV-14,99 min,Comedies

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6234 entries, 0 to 6233
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       6234 non-null   int64
 1   type          6234 non-null   object
 2   country       5758 non-null   object
 3   date_added    6223 non-null   object
 4   release_year  6234 non-null   int64
 5   rating        6224 non-null   object
 6   duration      6234 non-null   object
 7   listed_in     6234 non-null   object
dtypes: int64(2), object(6)
memory usage: 438.3+ KB

In [13]:
#Coverting show_id to string data type
df['show_id']=df['show_id'].astype('object')

In [14]:
print (df.dtypes)

show_id         object
type            object
country         object
date_added      object
release_year     int64
rating          object
duration        object
listed_in       object
dtype: object

In [15]:
df["date_added"]=pd.to_datetime(df["date_added"])
df["date_added"].head()

0   2019-09-09
1   2016-09-09
2   2018-09-08
3   2018-09-08
4   2017-09-08
Name: date_added, dtype: datetime64[ns]

In [16]:
df["date_added"].dt.year

0       2019.0
1       2016.0
2       2018.0
3       2018.0
4       2017.0
         ...
6229       NaN
6230       NaN
6231       NaN
6232       NaN
6233       NaN
Name: date_added, Length: 6234, dtype: float64

In [17]:
df[['duration','Unit']]=df['duration'].str.split(' ', expand=True)
df.head()

,show_id,type,country,date_added,release_year,rating,duration,listed_in,Unit
0,81145628,Movie,"United States, India, South Korea, China",2019-09-09,2019,TV-PG,90,"Children & Family Movies, Comedies",min
1,80117401,Movie,United Kingdom,2016-09-09,2016,TV-MA,94,Stand-Up Comedy,min
2,70234439,TV Show,United States,2018-09-08,2013,TV-Y7-FV,1,Kids' TV,Season
3,80058654,TV Show,United States,2018-09-08,2016,TV-Y7,1,Kids' TV,Season
4,80125979,Movie,United States,2017-09-08,2017,TV-14,99,Comedies,min

In [62]:
df['rating'].nunique()

14

**Maturity ratings for TV shows and movies on Netflix:**
**Kids**
TV-Y Designed to be appropriate for all children

TV-Y7 Suitable for ages 7 and up

G Suitable for General Audiences

TV-G Suitable for General Audiences

PG Parental Guidance suggested

TV-PG Parental Guidance suggested

**Teens**
PG-13 Parents strongly cautioned. May be Inappropriate for ages 12 and under.

TV-14 Parents strongly cautioned. May not be suitable for ages 14 and under.

**Adults**
R Restricted. May be inappropriate for ages 17 and under.

TV-MA For Mature Audiences. May not be suitable for ages 17 and under.

NC-17 Inappropriate for ages 17 and under

In [52]:
rating_count=df['rating'].value_counts()
rating_count

TV-MA       2027
TV-14       1698
TV-PG        701
R            508
PG-13        286
NR           218
PG           184
TV-Y7        169
TV-G         149
TV-Y         143
TV-Y7-FV      95
G             37
UR             7
NC-17          2
Name: rating, dtype: int64

In [53]:
rating_grp=df.groupby(['rating'])

In [54]:
US_rating=rating_grp['country'].apply(lambda x:x.str.contains('United States').sum())
US_rating

rating
G            32
NC-17         1
NR          102
PG          150
PG-13       249
R           398
TV-14       417
TV-G         68
TV-MA       737
TV-PG       252
TV-Y         60
TV-Y7        73
TV-Y7-FV     65
UR            3
Name: country, dtype: int64

In [55]:
rating_df=pd.concat([rating_count,US_rating],axis='columns',sort=False)
rating_df

          rating  country
TV-MA       2027      737
TV-14       1698      417
TV-PG        701      252
R            508      398
PG-13        286      249
NR           218      102
PG           184      150
TV-Y7        169       73
TV-G         149       68
TV-Y         143       60
TV-Y7-FV      95       65
G             37       32
UR             7        3
NC-17          2        1

In [56]:
rating_df.rename(columns={'rating':'TotalRating','country':'USRating'},inplace=True)

In [78]:
rating_df['Pct_US_Rating']=(rating_df['USRating']/rating_df['TotalRating']) *100
rating_df

          TotalRating  USRating  Pct_US_Rating
PG-13             286       249      87.062937
G                  37        32      86.486486
PG                184       150      81.521739
R                 508       398      78.346457
TV-Y7-FV           95        65      68.421053
NC-17               2         1      50.000000
NR                218       102      46.788991
TV-G              149        68      45.637584
TV-Y7             169        73      43.195266
UR                  7         3      42.857143
TV-Y              143        60      41.958042
TV-MA            2027       737      36.359151
TV-PG             701       252      35.948645
TV-14            1698       417      24.558304

In [81]:
rating_df.sort_values(by='Pct_US_Rating',ascending=False,inplace=True)
rating_df

          TotalRating  USRating  Pct_US_Rating
PG-13             286       249      87.062937
G                  37        32      86.486486
PG                184       150      81.521739
R                 508       398      78.346457
TV-Y7-FV           95        65      68.421053
NC-17               2         1      50.000000
NR                218       102      46.788991
TV-G              149        68      45.637584
TV-Y7             169        73      43.195266
UR                  7         3      42.857143
TV-Y              143        60      41.958042
TV-MA            2027       737      36.359151
TV-PG             701       252      35.948645
TV-14            1698       417      24.558304

In [80]:
filter=df['type']=='Movie'
df.loc[filter]['country'].str.contains('United States').sum()

1924

In [72]:
type_count=df['type'].value_counts()
type_count

Movie      4265
TV Show    1969
Name: type, dtype: int64

In [73]:
type_grp=df.groupby(['type'])

In [74]:
US_group=type_grp['country'].apply(lambda x:x.str.contains('United States').sum())
US_group

type
Movie      1924
TV Show     686
Name: country, dtype: int64

In [75]:
type_df=pd.concat([type_count,US_group],axis='columns',sort=False)
type_df

         type  country
type
Movie    4265     1924
TV Show  1969      686

In [76]:
type_df.rename(columns={'type':'Total','country':'US'},inplace=True)
type_df

         Total    US
type
Movie     4265  1924
TV Show   1969   686

In [77]:
type_df['Pct_US_type']=(type_df['US']/type_df['Total'])*100
type_df

         Total    US  Pct_US_type
type
Movie     4265  1924    45.111372
TV Show   1969   686    34.840020

In [82]:
rating_df.loc['PG-13']

TotalRating      286.000000
USRating         249.000000
Pct_US_Rating     87.062937
Name: PG-13, dtype: float64

In [83]:
type_df.loc['Movie']

Total          4265.000000
US             1924.000000
Pct_US_type      45.111372
Name: Movie, dtype: float64